app/controllers/admin_users_controller.rb

  def create
    admin_user = AdminUser.new(name: params[:name],
                               email: params[:email],
                               phone: params[:phone],
                               designation: params[:designation],
                               password: params[:password])

    if admin_user.save
---
INSERT INTO "admin_users" ("name", "email", "phone", "password_digest", "designation", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"