app/controllers/admin_user_controller.rb

  def create
    admin_user = AdminUser.new(name: params[:name],
                                email: params[:email],
		                            phone: params[:phone],
                                designation: params[:designation],
		                            municipal_id: params[:municipal_id],
                                password: params[:password])

    if admin_user.save
---
INSERT INTO "admin_users" ("name", "email", "created_at", "updated_at", "password_digest", "phone", "designation") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"