app/controllers/auth_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "qwertyu@qwertyu.com"], ["LIMIT", 1]]
INSERT INTO "api_keys" ("secret_key", "user_id", "user_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["secret_key", "bEFXASgRDRyfyNiEMSj1KoRp"], ["user_id", 4], ["user_token", "oQ8Svqv64LnsMRCSXaJYah4R"], ["created_at", 2018-04-17 07:42:15 UTC], ["updated_at", 2018-04-17 07:42:15 UTC]]
SELECT  "api_keys".* FROM "api_keys" WHERE "api_keys"."user_id" = $1 LIMIT $2  [["user_id", 4], ["LIMIT", 1]]
UPDATE "api_keys" SET "user_type" = $1, "updated_at" = $2 WHERE "api_keys"."id" = $3  [["user_type", "visitor"], ["updated_at", 2018-04-17 07:50:15 UTC], ["id", 19]]
---
  def user_login
    if params[:password] && params[:email]
      user = User.where(email: params[:email]).first

      if user && user.authenticate(params[:password])
        # api_key = ApiKey.new
        # api_key.user_id = user.id
        # api_key.user_type = "visitor"
        # api_key.save
        # secret_key = api_key.secret_key
        # access_token = api_key.user_token

        api_key = ApiKey.find_or_create_by(user_id: user.id)
        api_key.user_type = 'visitor'
        api_key.save

SELECT  "admin_users".* FROM "admin_users" WHERE "admin_users"."email" = $1 ORDER BY "admin_users"."id" ASC LIMIT $2  [["email", "garg.jparah@yahoo.inhg"], ["LIMIT", 1]]
INSERT INTO "api_keys" ("secret_key", "user_id", "user_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["secret_key", "VMYFhL7uvYKWJqis3xN4GwaL"], ["user_id", 1], ["user_token", "vPScrp4Vh2MLARbwcSJV832s"], ["created_at", 2018-04-17 08:29:26 UTC], ["updated_at", 2018-04-17 08:29:26 UTC]]
SELECT  "api_keys".* FROM "api_keys" WHERE "api_keys"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
UPDATE "api_keys" SET "user_type" = $1, "updated_at" = $2 WHERE "api_keys"."id" = $3  [["user_type", "admin"], ["updated_at", 2018-04-17 08:29:26 UTC], ["id", 21]]
---
  def admin_login
    if params[:password] && params[:email]
      user = AdminUser.where(email: params[:email]).first

      if user && user.authenticate(params[:password])
        api_key = ApiKey.find_or_create_by(user_id: user.id)
        api_key.user_type = "admin"
        api_key.save

SELECT  "api_keys".* FROM "api_keys" WHERE "api_keys"."secret_key" = $1 AND "api_keys"."user_token" = $2 AND "api_keys"."user_type" = $3 ORDER BY "api_keys"."id" ASC LIMIT $4  [["secret_key", "SD2rt29gxdRWugeEafTgL5fJ"], ["user_token", "apSpaxUAeM2PrKjBARctheso"], ["user_type", "visitor"], ["LIMIT", 1]]
DELETE FROM "api_keys" WHERE "api_keys"."id" = $1  [["id", 8]]
---
  def logout_user
    key = ApiKey.where(secret_key: request.headers["HTTP_SECRET_KEY"],
                       user_token: request.headers["HTTP_ACCESS_TOKEN"], user_type: "visitor").first

    if key.delete