app/controllers/complaint_chats_controller.rb

  def create_chat
    complaint_chat = ComplaintChat.new(chats: params[:chats],
                              role: params[:role],
                              image: params[:image],
                              complaint_id: params[:complaint_id] )

    if complaint_chat.save
---
INSERT INTO "complaint_chats" ("chats", "role", "complaint_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["chats", "hello"], ["role", "user"], ["complaint_id", 1], ["created_at", 2018-04-16 11:55:05 UTC], ["updated_at", 2018-04-16 11:55:05 UTC]]

  def show_complaint_chats
    complaint_id = Complaint.find(params[:id])
    complaints_chats = ComplaintChat.where(complaint_id: complaint_id)
---
SELECT  "complaints".* FROM "complaints" WHERE "complaints"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "complaint_chats".* FROM "complaint_chats" WHERE "complaint_chats"."complaint_id" = 1