app/controllers/complaints_controller.rb

  def create
    complaint = Complaint.new(subject: params[:subject],

                                description: params[:description],
                                image: params[:image],
                                user_id: get_logged_in_user_id)

    user = User.find(get_logged_in_user_id)

      if complaint.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "complaints" ("subject", "description", "image", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["subject", "fees"], ["description", "fees"], ["image", "123456"], ["user_id", 3], ["created_at", 2018-04-12 08:32:09 UTC], ["updated_at", 2018-04-12 08:32:09 UTC]]