app/controllers/complaint_chats_controller.rb

  def create
    @complaint_chat = ComplaintChat.new(complaint_chat_params)

    if @complaint_chat.save
---
INSERT INTO "complaint_chats" ("chats", "role", "complaint_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["chats", "hello"], ["role", "user"], ["complaint_id", 1], ["created_at", 2018-04-16 10:25:50 UTC], ["updated_at", 2018-04-16 10:25:50 UTC]]