app/controllers/complaints_controller.rb

INSERT INTO "complaints" ("subject", "description", "image", "user_id", "created_at", "updated_at", "status") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["subject", "fees"], ["description", "fees"], ["image", "123456"], ["user_id", 3], ["created_at", 2018-04-16 05:49:00 UTC], ["updated_at", 2018-04-16 05:49:00 UTC], ["status", "pending"]]
---
  def create_complaint
    complaint = Complaint.new(subject: params[:subject],
                              description: params[:description],
                              image: params[:image],
                              user_id: get_logged_in_user_id,
                              status: "pending",
                              resolved: "Conclusion")

    if complaint.save

SELECT "complaints".* FROM "complaints" WHERE "complaints"."user_id" = $1 AND "complaints"."status" = $2  [["user_id", 3], ["status", "pending"]]
---
  def show_user_complaints
    user_id = get_logged_in_user_id
    complaints = Complaint.where(user_id: user_id, status: "pending")

SELECT "complaints".* FROM "complaints" WHERE "complaints"."status" = $1  [["status", "pending"]]
---
  def pending_complaint_list
    complaints = Complaint.where(status: "pending")

SELECT "complaints".* FROM "complaints" WHERE "complaints"."status" = $1  [["status", "resolved"]]
---
  def resolved_complaint_list
    complaints = Complaint.where(status: "resolved")

SELECT  "complaints".* FROM "complaints" WHERE "complaints"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "complaints" SET "status" = $1, "resolved" = $2, "updated_at" = $3 WHERE "complaints"."id" = $4  [["status", "resolved"], ["resolved", "We have successfully waived the fine"], ["updated_at", 2018-04-17 09:25:39 UTC], ["id", 6]]
---
  def resolve_complaint
    if params[:complaint_id]
      complaint= Complaint.find(params[:complaint_id])
      complaint.status = "resolved"
      complaint.resolved = params[:resolved]

      if complaint.save