app/controllers/user_controller.rb

  def signup
    user = User.new(name: params[:name],
                    contact: params[:contact],
                    email: params[:email],
                    password: params[:password],
                    phone_no_verified: false,
                    email_verified: false)

    if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "contact", "enroll_no") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"