app/controllers/users_controller.rb

INSERT INTO "users" ("enroll_no", "branch", "semester", "name", "contact", "email", "verified", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    user = User.new(name: params[:name],
                    contact: params[:contact],
                    email: params[:email],
                    password: params[:password],
                    enroll_no: params[:enroll_no],
                    branch: params[:branch],
                    semester: params[:semester],
                    verified: "false")

    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "users" SET "verified" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["verified", true], ["updated_at", 2018-04-17 08:57:11 UTC], ["id", 4]]
---
  def verify_user
    if params[:user_id]
      user = User.find(params[:user_id])
      user.verified = "true"
      if user.save

SELECT "users".* FROM "users" WHERE "users"."verified" = $1  [["verified", "false"]]
---
  def unverified_user_list
    users = User.where(verified: "false")

SELECT "users".* FROM "users" WHERE "users"."verified" = $1  [["verified", "true"]]
---
  def verified_user_list
    users = User.where(verified: "true")